Autodesk.Revit.DB.Form.Rehost(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.XYZ)
Rehost Form to sketch plane
sketchPlane: The sketch plane on which to rehost the form.
location: The location to which to Rehost the form.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the sketchPlane or location is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when rehosting Form failed.
Since: 2011

Autodesk.Revit.DB.Form.Rehost(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Rehost Form to edge, face or curve.
hostRef: The geometry reference on which to rehost the form.
location: The location to which to Rehost the form.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the hostRef or location is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when rehosting Form failed.
Since: 2011

Autodesk.Revit.DB.Form.BaseOffset
Retrieve/set the base offset of the form object. It is only valid for locked form.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when this is not a locked form.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the value is invalid.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown when it fail to get/set BaseOffset.

Autodesk.Revit.DB.Form.TopOffset
Retrieve/set the top offset of the form object. It is only valid for locked form.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when this is not a locked form.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the value is invalid.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown when it fail to get/set TopOffset.

Autodesk.Revit.DB.Form.AddProfile(Autodesk.Revit.DB.Reference,System.Double)
Add a profile into the form, by a specified edge/param.
edgeReference: The geometry reference of edge.
param: The param on edge to specify the location.
Returns: Index of newly created profile.

Autodesk.Revit.DB.Form.AddEdge(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
Add an edge to the form, connecting two edges on same/different profile, by a pair of specified points.
startPointReference: The geometry reference of start point
endPointReference: The geometry reference of end point

Autodesk.Revit.DB.Form.AddEdge(Autodesk.Revit.DB.Reference,System.Double,Autodesk.Revit.DB.Reference,System.Double)
Add an edge to the form, connecting two edges on same/different profile, by a pair of specified edge/param.
startEdgeReference: The geometry reference of start edge
startParam: The param on start edge to specify the location.
endEdgeReference: The geometry reference of end edge
endParam: The param on end edge to specify the location.

Autodesk.Revit.DB.Form.AddEdge(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Add an edge to the form, connecting two edges on different profiles, by a specified face of the form and a point on face.
faceReference: The geometry reference of face
point: A point on the face, defining the position of edge to be created.

Autodesk.Revit.DB.Form.ScaleProfile(System.Int32,System.Double,Autodesk.Revit.DB.XYZ)
Scale a profile of the form, by a specified origin and scale factor.
profileIndex: Index to specify the profile.
factor: The scale factor, it should be large than zero.
origin: The origin where scale happens.

Autodesk.Revit.DB.Form.ScaleSubElement(Autodesk.Revit.DB.Reference,System.Double,Autodesk.Revit.DB.XYZ)
Scale a face/edge/curve/vertex of the form, by a specified origin and scale factor.
subElementReference: The geometry reference of face/edge/curve/vertex
factor: The scale factor, it should be large than zero.
origin: The origin where scale happens.

Autodesk.Revit.DB.Form.RotateProfile(System.Int32,Autodesk.Revit.DB.Line,System.Double)
Rotate a profile of the form, by a specified angle around a given axis.
profileIndex: Index to specify the profile.
axis: An unbounded line that represents the axis of rotation.
angle: The angle, in radians, by which the element is to be rotated around the specified axis.

Autodesk.Revit.DB.Form.RotateSubElement(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Line,System.Double)
Rotate a face/edge/curve/vertex of the form, by a specified angle around a given axis.
subElementReference: The geometry reference of face/edge/curve/vertex
axis: An unbounded line that represents the axis of rotation.
angle: The angle, in radians, by which the element is to be rotated around the specified axis.

Autodesk.Revit.DB.Form.MoveProfile(System.Int32,Autodesk.Revit.DB.XYZ)
Move a profile of the form, specified by a reference, and an offset vector.
profileIndex: Index to specify the profile.
offset:  The vector by which the element is to be moved.

Autodesk.Revit.DB.Form.MoveSubElement(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ)
Move a face/edge/curve/vertex of the form, specified by a reference, and an offset vector.
subElementReference: The geometry reference of face/edge/curve/vertex
offset:  The vector by which the element is to be moved.

Autodesk.Revit.DB.Form.DeleteProfile(System.Int32)
Delete a profile of the form.
profileIndex: Index to specify the profile.

Autodesk.Revit.DB.Form.DeleteSubElement(Autodesk.Revit.DB.Reference)
Delete a face/edge/curve/vertex of the form, specified by a reference.
subElementReference: The geometry reference of face/edge/curve/vertex

Autodesk.Revit.DB.Form.CanManipulateProfile(System.Int32)
Tell if a profile can be deleted/moved/rotated.
profileIndex: Index to specify the profile.
It only gives an aggressive answer. Some operations may still cause failure, even this method says "yes".

Autodesk.Revit.DB.Form.CanManipulateSubElement(Autodesk.Revit.DB.Reference)
Tell if a sub element can be deleted/moved/rotated/scaled.
subElementReference: The geometry reference of face/edge/curve/vertex
It only gives an aggressive answer. Some operations may still cause failure, even this method says "yes".

Autodesk.Revit.DB.Form.GetCurvesAndEdgesReference(Autodesk.Revit.DB.Reference)
Given a point, return all edges and curves that it is lying on.
pointReference: The reference of a point.
Returns: Reference array containing all edges and curves that the point is lying on.

Autodesk.Revit.DB.Form.GetControlPoints(Autodesk.Revit.DB.Reference)
Given an edge or a curve or a face, return all control points lying on it (in form of geometry references).
curveOrEdgeOrFaceReference: The reference of an edge or curve or face.
Returns: Reference array containing all control points lying on it.

Autodesk.Revit.DB.Form.IsConnectingEdge(Autodesk.Revit.DB.Reference)
Tell if an edge is a connecting edge on a side face. Connecting edges connect vertices on different profiles.
edgeReference: The reference of the edge to be checked.

Autodesk.Revit.DB.Form.IsProfileEdge(Autodesk.Revit.DB.Reference)
Tell if an edge or curve is generated from a profile.
curveOrEdgeReference: The reference of the edge or curve to be checked.

Autodesk.Revit.DB.Form.IsAutoCreaseEdge(Autodesk.Revit.DB.Reference)
Tell if an edge is an auto-crease on a top/bottom cap face.
edgeReference: The reference of the edge to be checked.
An auto crease edge is created when top/bottom cap face cannot be made by a planar face.

Autodesk.Revit.DB.Form.IsSideFace(Autodesk.Revit.DB.Reference)
Given a face, tell if it is a side face.
faceReference: The reference of the  face to be checked.

Autodesk.Revit.DB.Form.IsEndFace(Autodesk.Revit.DB.Reference)
Given a face, tell if it is an end cap face.
faceReference: The reference of the face to be checked.

Autodesk.Revit.DB.Form.IsBeginningFace(Autodesk.Revit.DB.Reference)
Given a face, tell if it is a beginning cap face.
faceReference: The reference of the  face to be checked.

Autodesk.Revit.DB.Form.IsReferenceOnlyProfile(System.Int32)
Tell if the profile is made by referencing existing geometry in the Revit model.
profileIndex: Index to specify the profile to be checked.

Autodesk.Revit.DB.Form.IsFaceReference(Autodesk.Revit.DB.Reference)
Tell if the pick is the reference to a face of the form.
faceReference: Reference to be checked.

Autodesk.Revit.DB.Form.IsCurveReference(Autodesk.Revit.DB.Reference)
Tell if the pick is the reference to a curve of the form.
curveReference: Reference to be checked.

Autodesk.Revit.DB.Form.IsEdgeReference(Autodesk.Revit.DB.Reference)
Tell if the pick is the reference to an edge of the form.
edgeReference: Reference to be checked.

Autodesk.Revit.DB.Form.IsVertexReference(Autodesk.Revit.DB.Reference)
Tell if the pick is the reference to a vertex of the form.
vertexReference: Reference to be checked.

Autodesk.Revit.DB.Form.HasOpenGeometry
Tell if the form has an open geometry.

Autodesk.Revit.DB.Form.ConstrainProfiles(System.Int32)
Constrain form profiles using the specified profile as master. This is an advanced version of property "AreProfilesConstrained", allowing specify the master profile.
masterProfileIndex: Index to specify the profile used as master profile.
If "masterProfileIndex" is less than zero, the form will become unconstrained, it has the same effect as "AreProfilesConstrained = false".
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation can only be performed on a swept blend form.

Autodesk.Revit.DB.Form.AreProfilesConstrained
Get/set if the form's profiles are constrained.
There is another method "constrainProfile" to constrain profile using certain profile as the master one.
If this property is used to constrain the form, the first profile will be automatically selected as master profile.
When form profiles are constrained, changing one profile also changes all other profiles at the same time.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property to 'true'
This operation can only be performed on a swept blend form.

Autodesk.Revit.DB.Form.IsInXRayMode
Get/set if the form is in X-Ray mode.

Autodesk.Revit.DB.Form.HasOneOrMoreReferenceProfiles
Tell if the form has any reference profile.

Autodesk.Revit.DB.Form.GetPathCurveIndexByCurveReference(Autodesk.Revit.DB.Reference)
Given a reference to certain curve in the path, return its index.
curveReference: Reference to the curve in path

Autodesk.Revit.DB.Form.PathCurveReference(System.Int32)
The curve reference in the path, specified by curve index.
curveIndex: Index to specify the curve in path

Autodesk.Revit.DB.Form.PathCurveCount
The number of curves in the form path.

Autodesk.Revit.DB.Form.GetProfileAndCurveLoopIndexFromReference(Autodesk.Revit.DB.Reference,System.Int32@,System.Int32@)
Given a reference to certain curve or edge, get the index of its profile and curve loop respectively.
curveOrEdgeReference: Reference to a curve/edge that is part of one profile
profileIndex: Profile index for output
curveLoopIndex: Curve loop index for output
Usually a profile generates edges, but sometimes it generates curves. For example, if there is a middle profile which does not change the
shape of form, curves are generated instead of edges.

Autodesk.Revit.DB.Form.CurveLoopReferencesOnProfile(System.Int32,System.Int32)
The curve references in certain curve loop, specified by profile index and curve loop index.
profileIndex: Index to specify the profile, should be within 0 and (ProfileCount - 1).
curveLoopIndex: Index to specify the curve loop, should be within 0 and (CurveLoopCount - 1).

Autodesk.Revit.DB.Form.ProfileCurveLoopCount(System.Int32)
The number of curve loops in certain profile, specified by profile index.
index: Index to specify the profile, should be within 0 and (ProfileCount - 1).

Autodesk.Revit.DB.Form.ProfileCount
The number of profiles in the form.

Autodesk.Revit.DB.Form
An object that represents a Form within the Autodesk Revit Massing Family.
Remarks: For any reference returned from a Form method, its GeometryObject will become invalid after a form modification method, e.g. MoveSubElement.
Call the method on the Form object to retrieve the new reference if it is needed after the modification.